STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_TZ/NonSecure/System/Modules/Flash/simple_nvm_arbiter.c
            /* Add the bank size to the address offset */
            addressOffset = addressOffset + ((SNVMA_NvmConfiguration[nvmIdx].BankSize * FLASH_PAGE_SIZE));

            /* Update bank conf index */
            bankConfIdx++;
          }
        }
      }

      if (error == SNVMA_ERROR_NOK)
      {
        /* Init is over, all OK */
        SNVMA_ModuleInit = TRUE;

        error = SNVMA_ERROR_OK;
      }

      /* Leave critical section */
      UTILS_EXIT_CRITICAL_SECTION ();
    }
  }

  return error;
}

SNVMA_Cmd_Status_t SNVMA_Register (const SNVMA_BufferId_t BufferId,
                                   const uint32_t * p_BufferAddress,
                                   const uint32_t BufferSize)
{
  SNVMA_Cmd_Status_t error = SNVMA_ERROR_NOK;

  uint8_t idxBuf = 0x00;
  uint8_t nvmId = (uint8_t)(BufferId / SNVMA_MAX_NUMBER_BUFFER);

  uint32_t offSet = sizeof (SNVMA_BankHeader_t);
  uint32_t neededSpace = SNVMA_ALIGN_128 ((BufferSize * sizeof (uint32_t)));

  /* Check if Module is initialized */
  if (SNVMA_ModuleInit == FALSE)
  {
    error = SNVMA_ERROR_NOT_INIT;
  }
  /* Check if there is no command pending */
  else if (SNVMA_CommandPending == TRUE)
  {
    error = SNVMA_ERROR_CMD_PENDING;
  }
  /* Check if buffer ID is in the configuration range */
  else if (BufferId >= SNVMA_BufferId_Max)
  {
    error = SNVMA_ERROR_BUFFERID_NOT_KNOWN;
  }
  /* Check for NULL buffer pointer */
  else if (p_BufferAddress == NULL)
  {
    error = SNVMA_ERROR_BUFFER_NULL;
  }
  /* Check buffer alignment - Shall be 32bits */
  else if (((uint32_t)p_BufferAddress & SNVMA_MASK_ALIGNMENT_32) != 0x00000000u)
  {
    error = SNVMA_ERROR_BUFFER_NOT_ALIGNED;
  }
  /* Check buffer size */
  else if (BufferSize == 0x00)
  {
    error = SNVMA_ERROR_BUFFER_SIZE;
  }
  /* Check if registration is still possible */
  else if ((SNVMA_NvmConfiguration[nvmId].a_Buffers[0].p_Addr != NULL) &&
           (SNVMA_NvmConfiguration[nvmId].a_Buffers[1].p_Addr != NULL) &&
           (SNVMA_NvmConfiguration[nvmId].a_Buffers[2].p_Addr != NULL) &&
           (SNVMA_NvmConfiguration[nvmId].a_Buffers[3].p_Addr != NULL))
  {
    error = SNVMA_ERROR_NVM_BUFFER_FULL;
  }
  else
  {
    /* Check if registration will overflow the bank */
    for (uint8_t cnt = 0x00;
         (cnt < SNVMA_MAX_NUMBER_BUFFER) && (error == SNVMA_ERROR_NOK);
         cnt++)
    {
      /* Compute occupied space */
      if (SNVMA_NvmConfiguration[nvmId].a_Buffers[cnt].p_Addr != NULL)
      {
        neededSpace = neededSpace + SNVMA_ALIGN_128 ((SNVMA_NvmConfiguration[nvmId].a_Buffers[cnt].Size *
                                                      sizeof (uint32_t)));

        if (((neededSpace + offSet)) > (SNVMA_NvmConfiguration[nvmId].BankSize * FLASH_PAGE_SIZE))
        {
          error = SNVMA_ERROR_BUFFER_SIZE;
        }
      }
    }

    if (error == SNVMA_ERROR_NOK)
    {
      /* Enter critical section */
      UTILS_ENTER_CRITICAL_SECTION();

      /* Compute the index in the buffer array */
      idxBuf = BufferId % SNVMA_MAX_NUMBER_BUFFER;

      /* Register the buffer */
      SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].p_Addr = (uint32_t *)p_BufferAddress;
      SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size = BufferSize;

      /* Update buffer write addr for the whole bank */
      for (uint8_t cnt = 0x00;
           cnt < SNVMA_MAX_NUMBER_BUFFER;
           cnt++)
      {
        if (SNVMA_NvmConfiguration[nvmId].a_Buffers[cnt].p_Addr != NULL)
        {
          /* Compute buffer address in bank - It shall be align 128bits */
          SNVMA_NvmConfiguration[nvmId].p_BankForWrite->ap_BufferAddr[cnt] =
            (uint32_t *)(((uint32_t)SNVMA_NvmConfiguration[nvmId].p_BankForWrite->p_StartAddr) + offSet);

          /* Update offset value */
          offSet = offSet + SNVMA_ALIGN_128 ((SNVMA_NvmConfiguration[nvmId].a_Buffers[cnt].Size *
                                              sizeof (uint32_t)));
        }
      }

      /* Leave critical section */
      UTILS_EXIT_CRITICAL_SECTION ();

      error = SNVMA_ERROR_OK;
    }
  }

  LOG_ERROR_SYSTEM("\r\nSNVMA_Register returned %d", (uint8_t)error);

  return error;
}

SNVMA_Cmd_Status_t SNVMA_Restore (const SNVMA_BufferId_t BufferId)
{
  SNVMA_Cmd_Status_t error = SNVMA_ERROR_NOK;

  uint8_t nvmId =  (uint8_t)(BufferId / SNVMA_MAX_NUMBER_BUFFER);
  uint8_t idxBuf = (uint8_t)(BufferId % SNVMA_MAX_NUMBER_BUFFER);

  uint32_t * p_bufferFlashAddr = NULL;
  uint32_t paddingOffset = 0x00;

  SNVMA_BankHeader_t * p_bankHeader = NULL;

  /* Check if initialized */
  if (SNVMA_ModuleInit == FALSE)
  {
    error = SNVMA_ERROR_NOT_INIT;
  }
  /* Check if there is no command pending */
  else if (SNVMA_CommandPending == TRUE)
  {
    error = SNVMA_ERROR_CMD_PENDING;
  }
  /* Check buffer id */
  else if (BufferId >= SNVMA_BufferId_Max)
  {
    error = SNVMA_ERROR_BUFFERID_NOT_KNOWN;
  }
  /* Check if buffer is registered */
  else if (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].p_Addr == NULL)
  {
    error = SNVMA_ERROR_BUFFERID_NOT_REGISTERED;
  }
  /* Check if there is a bank in use - To restore from */
  else if (SNVMA_NvmConfiguration[nvmId].p_BankForRestore == NULL)
  {
    error = SNVMA_ERROR_NVM_BANK_EMPTY;
  }
  else
  {
    /* Enter critical section */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Set that a command is pending */
    SNVMA_CommandPending = TRUE;

    /* Check bank integrity - Header plausibility */
    if (IsHeaderOk (SNVMA_NvmConfiguration[nvmId].p_BankForRestore->p_StartAddr,
                    nvmId) == FALSE)
    {
      error = SNVMA_ERROR_NVM_BANK_CORRUPTED;
    }
    /* Check bank integrity - CRC value */
    else if (IsCrcOk (SNVMA_NvmConfiguration[nvmId].p_BankForRestore->p_StartAddr) == FALSE)
    {
      error = SNVMA_ERROR_NVM_BANK_CORRUPTED;
    }
    else
    {
      /* Get the bank header */
      p_bankHeader = (SNVMA_BankHeader_t *)SNVMA_NvmConfiguration[nvmId].p_BankForRestore->p_StartAddr;

      /* Compute the address of the buffer in flash */
      if ((BufferId == p_bankHeader->BufferId1) &&
          (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size == p_bankHeader->SizeId1))
      {
        paddingOffset = sizeof (SNVMA_BankHeader_t);
      }
      else if ((BufferId == p_bankHeader->BufferId2) &&
               (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size == p_bankHeader->SizeId2))
      {
        paddingOffset = sizeof (SNVMA_BankHeader_t) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId1 * sizeof (uint32_t)));

