STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_TZ/NonSecure/System/Modules/Flash/simple_nvm_arbiter.c
      }
      else if ((BufferId == p_bankHeader->BufferId3) &&
               (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size == p_bankHeader->SizeId3))
      {
        paddingOffset = sizeof (SNVMA_BankHeader_t) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId1 * sizeof (uint32_t))) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId2 * sizeof (uint32_t)));
      }
      else if ((BufferId == p_bankHeader->BufferId4) &&
               (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size == p_bankHeader->SizeId4))
      {
        paddingOffset = sizeof (SNVMA_BankHeader_t) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId1 * sizeof (uint32_t))) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId2 * sizeof (uint32_t))) +
                        SNVMA_ALIGN_128((p_bankHeader->SizeId3 * sizeof (uint32_t)));
      }
      else
      {
        /* Buffer config in header is not the same as the one requested/registered */
        error = SNVMA_ERROR_BUFFER_CONFIG_MISSMATCH;
      }

      /* All OK, proceed to restore */
      if (error == SNVMA_ERROR_NOK)
      {
        p_bufferFlashAddr = (uint32_t *)((uint32_t)SNVMA_NvmConfiguration[nvmId].p_BankForRestore->p_StartAddr +
                                         paddingOffset);

        /* Restore the data in RAM */
        memcpy ((void *)SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].p_Addr,
                (void *)p_bufferFlashAddr,
                (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].Size * sizeof (uint32_t)));

        error = SNVMA_ERROR_OK;
      }
    }

    /* Release the pending flag */
    SNVMA_CommandPending = FALSE;

    /* Leave critical section */
    UTILS_EXIT_CRITICAL_SECTION ();
  }

  LOG_ERROR_SYSTEM("\r\nSNVMA_Restore returned %d", (uint8_t)error);

  return error;
}

SNVMA_Cmd_Status_t SNVMA_Write (const SNVMA_BufferId_t BufferId,
                                void (* Callback) (SNVMA_Callback_Status_t))
{
  SNVMA_Cmd_Status_t error = SNVMA_ERROR_NOK;

  uint8_t nvmId =  (uint8_t)(BufferId / SNVMA_MAX_NUMBER_BUFFER);
  uint8_t idxBuf = (uint8_t)(BufferId % SNVMA_MAX_NUMBER_BUFFER);

  /* Check if initialized */
  if (SNVMA_ModuleInit == FALSE)
  {
    error = SNVMA_ERROR_NOT_INIT;
  }
  /* Check buffer id */
  else if (BufferId >= SNVMA_BufferId_Max)
  {
    error = SNVMA_ERROR_BUFFERID_NOT_KNOWN;
  }
  /* Check if buffer is registered */
  else if (SNVMA_NvmConfiguration[nvmId].a_Buffers[idxBuf].p_Addr == NULL)
  {
    error = SNVMA_ERROR_BUFFERID_NOT_REGISTERED;
  }
  else
  {
    /* Enter critical section */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Set the impacted NVM */
    SNVMA_IdBitmask |= (1u << nvmId);

    LOG_INFO_SYSTEM("\r\nSNVMA_Write - Impacted NVM : %d", SNVMA_IdBitmask);

    /* Store the pending buffer ... */
    SNVMA_NvmConfiguration[nvmId].PendingBufferWriteOp |= (1u << idxBuf);

    LOG_INFO_SYSTEM("\r\nSNVMA_Write - Pending buffer : %d", (uint8_t)(1u << idxBuf));

    /* ... and the callback - Can be NULL */
    SNVMA_NvmConfiguration[nvmId].a_Callback[idxBuf] = Callback;

    /* Leave critical section */
    UTILS_EXIT_CRITICAL_SECTION ();

    /* Check if there is only one operation on going */
    if (SNVMA_CommandPending == FALSE)
    {
      /* Enter critical section */
      UTILS_ENTER_CRITICAL_SECTION();

      /* Set that a command is pending */
      SNVMA_CommandPending = TRUE;

      /* Leave critical section */
      UTILS_EXIT_CRITICAL_SECTION ();

      /* Check flash write status */
      if (StartFlashWrite (nvmId) == FM_ERROR)
      {
        /* Enter critical section */
        UTILS_ENTER_CRITICAL_SECTION();

        /* Reset command pending flag */
        SNVMA_CommandPending = FALSE;

        /* Clean flags */
        SNVMA_IdBitmask &= ~(1u << nvmId);
        SNVMA_NvmConfiguration[nvmId].PendingBufferWriteOp = 0u;

        for (uint8_t cnt = 0x00;
             cnt < SNVMA_MAX_NUMBER_BUFFER;
             cnt++)
        {
          SNVMA_NvmConfiguration[nvmId].a_Callback[cnt] = NULL;
        }

        /* Leave critical section */
        UTILS_EXIT_CRITICAL_SECTION ();

        error = SNVMA_ERROR_FLASH_ERROR;
      }
      else
      {
        /* Enter critical section */
        UTILS_ENTER_CRITICAL_SECTION();

        /* Flash op started */
        SNVMA_FlashInfo.NvmId = nvmId;
        SNVMA_FlashInfo.BufferId = idxBuf;
        SNVMA_FlashInfo.FlashOpState = SNVMA_HEADER_WRITE;

        /* Set request active */
        SNVMA_NvmConfiguration[nvmId].PendingBufferWriteOp =
          (SNVMA_NvmConfiguration[nvmId].PendingBufferWriteOp << SNVMA_MAX_NUMBER_BUFFER) & 0xF0u;

        /* Leave critical section */
        UTILS_EXIT_CRITICAL_SECTION ();

        LOG_INFO_SYSTEM("\r\nSNVMA_Write - Flash operation started (Header write request) : %d", (uint8_t)SNVMA_NvmConfiguration[nvmId].PendingBufferWriteOp);

        error = SNVMA_ERROR_OK;
      }
    }
    else
    {
      /* Request information are registered, it will dealt later on */
      error = SNVMA_ERROR_OK;
    }
  }

  return error;
}

/* Callback Definition ------------------------------------------------------*/
void SNVMA_FlashManagerCallback(FM_FlashOp_Status_t Status)
{
  FM_Cmd_Status_t flashFunRet = FM_ERROR;

  static uint8_t buffCnt = 0x00;

  static SNVMA_BankElt_t * tmpBank = NULL;

  /* Check Flash operation state */
  switch (SNVMA_FlashInfo.FlashOpState)
  {
    case SNVMA_HEADER_WRITE:
    {
      LOG_INFO_SYSTEM("\r\nSNVMA_FlashManagerCallback - Flash operation state : SNVMA_HEADER_WRITE");

      /* Check flash operation status */
      if (Status == FM_OPERATION_COMPLETE)
      {
        /* Check that header has been written correctly */
        if (IsSameContent ((uint32_t *)&SNVMA_WriteBankHeader,
                           (uint32_t *)SNVMA_NvmConfiguration[SNVMA_FlashInfo.NvmId].p_BankForWrite->p_StartAddr,
                           (sizeof (SNVMA_BankHeader_t) / sizeof (uint32_t))) == FALSE)
        {
          /* Enter critical section */
          UTILS_ENTER_CRITICAL_SECTION();

